Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/presidents_role_in_convening_the_oireachtas.html.txt.tmx
Source language: en
Languages: ga

source: President - Convening the Oireachtas
ga: An tUachtarán - Tithe an Oireachtais a Chomóradh

source: The President can convene a meeting of either or both Houses of the Oireachtas
ga: Is féidir leis an Uachtarán ceachtar de thithe an Oireachtais, nó iad araon, a chomóradh

source: Before doing so, the President must first consult with the Council of State
ga: Sula ndéanann sé/sí é sin ní mór don Uachtarán dul i gcomhairle leis an gComhairle Stáit

source: The President's power to convene a meeting of either or both Houses of the Oireachtas has never been exercised
ga: Níor tharla sé ariamh gur dhein an tUachtarán ceachtar de Thithe an Oireachtais, nó iad araon, a chomóradh

source: It might be used in an emergency situation
ga: D'fhéadfadh sé/sí é a dhéanamh i gcás práinne

source: At the meeting of either or both Houses of the Oireachtas, the President may communicate a message or address on any matter of national or public importance
ga: Is féidir leis an Uachtarán teachtaireacht nó aitheasc a chur faoin bhráid cheachtar de Thithe an Oireachtais, nó iad araon, i dtaobh aon ní a bhfuil tábhacht náisiúnta nó tábhacht phoiblí ann

source: The message or address must first be approved by the Government
ga: Ní mór don Rialtas an teachtaireacht nó aitheasc a cheadú ar dtús
